SdaiInstance
\details
The handle serves as the identifier of the instance. Identifiers are not persistent.
Identifiers shall be unique globally over all types of instances and unchanging within
an SDAI session for any particular instance.